{"entries":[
	{"date":"11/25/2015", "title":"Thankful", "text":"I have an almost unending list of things that I am thankful for. My loving and supportive family and friends are the obvious ones. I am also thankful for the life I have been given and all the sucesses I have had in my life. My life has been full of countless blessings and discisions that could have turned out poorly. One of those discisions I am most thankful for was my discisions to become a programmer. It was not even a thought when I first started college. Yet, on a whim I started studying programming my sophmore year. I have loved it ever since and could not imagine being in another field. "},
	{"date":"11/29/2015", "title":"Most Interesting Thing I Learned", "text":"Even though I had a degree in computer science before taking this course, I have already learned a great deal. The newest thing for me was learning the basics of photoshop. The lesson that was most frustrating for me to learn would be getting JSON to properly load over the server for the first time. The easiest thing I learned would probably be Jquery, since I already know some javascript. However, the coolest thing I have learned was not so much a language, syntax, or programming skill. Instead, the coolest thing I have learned is to be more confident in my skills. A belief that I can complete programs that before I considered too difficult for my skill level. I have learned the benefit of surrounding myself with others in my field so that ideas can blossom and improve with more insight. This class has also shown me that I love to share my knowledge with others. It has taught me the benefits of learning through teaching and built up my excitement for where my career might take me next."},
	{"date":"11/21/2015", "title":"Week 3", "text":"This week...........................................................The End"},
	{"date":"11/01/2015", "title":"Week 4", "text":"This other week...........................................................The End"},
	{"date":"11/14/2015", "title":"Week 5", "text":"This week...........................................................The End"},
	{"date":"11/01/2015", "title":"Week 6", "text":"This week...........................................................The End"},
	{"date":"11/01/2015", "title":"Week 7", "text":"This week...........................................................The End"}
]}